apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
/****************************************************************************
 * arch/arm/src/imxrt/imxrt_usbdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "arm_internal.h"
#include "hardware/imxrt_usbotg.h"
#include "hardware/imxrt_usbphy.h"
#ifdef CONFIG_ARCH_FAMILY_IMXRT106x
#  include "hardware/rt106x/imxrt106x_ccm.h"
#endif
#include "imxrt_periphclks.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#  define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef  CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

/* Enable reading SOF from interrupt handler vs. simply reading on demand.
 * Probably a bad idea... Unless there is some issue with sampling the SOF
 * from hardware asynchronously.
 */

#ifdef CONFIG_IMXRT_USBDEV_FRAME_INTERRUPT
#  define USB_FRAME_INT USBDEV_USBINTR_SRE
#else
#  define USB_FRAME_INT 0
#endif

#ifdef CONFIG_DEBUG_FEATURES
#  define USB_ERROR_INT USBDEV_USBINTR_UEE
#else
#  define USB_ERROR_INT 0
#endif

/* Debug ********************************************************************/

/* Trace error codes */

#define IMXRT_TRACEERR_ALLOCFAIL            0x0001
#define IMXRT_TRACEERR_BADCLEARFEATURE      0x0002
#define IMXRT_TRACEERR_BADDEVGETSTATUS      0x0003
#define IMXRT_TRACEERR_BADEPNO              0x0004
#define IMXRT_TRACEERR_BADEPGETSTATUS       0x0005
#define IMXRT_TRACEERR_BADEPTYPE            0x0006
#define IMXRT_TRACEERR_BADGETCONFIG         0x0007
#define IMXRT_TRACEERR_BADGETSETDESC        0x0008
#define IMXRT_TRACEERR_BADGETSTATUS         0x0009
#define IMXRT_TRACEERR_BADSETADDRESS        0x000a
#define IMXRT_TRACEERR_BADSETCONFIG         0x000b
#define IMXRT_TRACEERR_BADSETFEATURE        0x000c
#define IMXRT_TRACEERR_BINDFAILED           0x000d
#define IMXRT_TRACEERR_DISPATCHSTALL        0x000e
#define IMXRT_TRACEERR_DRIVER               0x000f
#define IMXRT_TRACEERR_DRIVERREGISTERED     0x0010
#define IMXRT_TRACEERR_EP0SETUPSTALLED      0x0011
#define IMXRT_TRACEERR_EPINNULLPACKET       0x0012
#define IMXRT_TRACEERR_EPOUTNULLPACKET      0x0013
#define IMXRT_TRACEERR_INVALIDCTRLREQ       0x0014
#define IMXRT_TRACEERR_INVALIDPARMS         0x0015
#define IMXRT_TRACEERR_IRQREGISTRATION      0x0016
#define IMXRT_TRACEERR_NOEP                 0x0017
#define IMXRT_TRACEERR_NOTCONFIGURED        0x0018
#define IMXRT_TRACEERR_REQABORTED           0x0019

/* Trace interrupt codes */

#define IMXRT_TRACEINTID_USB                0x0001
#define IMXRT_TRACEINTID_CLEARFEATURE       0x0002
#define IMXRT_TRACEINTID_DEVGETSTATUS       0x0003
#define IMXRT_TRACEINTID_DEVRESET           0x0004
#define IMXRT_TRACEINTID_DISPATCH           0x0005
#define IMXRT_TRACEINTID_EP0COMPLETE        0x0006
#define IMXRT_TRACEINTID_EP0NAK             0x0007
#define IMXRT_TRACEINTID_EP0SETUP           0x0008
#define IMXRT_TRACEINTID_EPGETSTATUS        0x0009
#define IMXRT_TRACEINTID_EPIN               0x000a
#define IMXRT_TRACEINTID_EPINQEMPTY         0x000b
#define IMXRT_TRACEINTID_EP0INSETADDRESS    0x000c
#define IMXRT_TRACEINTID_EPOUT              0x000d
#define IMXRT_TRACEINTID_EPOUTQEMPTY        0x000e
#define IMXRT_TRACEINTID_EP0SETUPSETADDRESS 0x000f
#define IMXRT_TRACEINTID_FRAME              0x0010
#define IMXRT_TRACEINTID_GETCONFIG          0x0011
#define IMXRT_TRACEINTID_GETSETDESC         0x0012
#define IMXRT_TRACEINTID_GETSETIF           0x0013
#define IMXRT_TRACEINTID_GETSTATUS          0x0014
#define IMXRT_TRACEINTID_IFGETSTATUS        0x0015
#define IMXRT_TRACEINTID_SETCONFIG          0x0016
#define IMXRT_TRACEINTID_SETFEATURE         0x0017
#define IMXRT_TRACEINTID_SUSPENDED          0x0018
#define IMXRT_TRACEINTID_RESUMED            0x0019
#define IMXRT_TRACEINTID_SYNCHFRAME         0x001a

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(IMXRT_TRACEERR_ALLOCFAIL),
  TRACE_STR(IMXRT_TRACEERR_BADCLEARFEATURE),
  TRACE_STR(IMXRT_TRACEERR_BADDEVGETSTATUS),
  TRACE_STR(IMXRT_TRACEERR_BADEPNO),
  TRACE_STR(IMXRT_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(IMXRT_TRACEERR_BADEPTYPE),
  TRACE_STR(IMXRT_TRACEERR_BADGETCONFIG),
  TRACE_STR(IMXRT_TRACEERR_BADGETSETDESC),
  TRACE_STR(IMXRT_TRACEERR_BADGETSTATUS),
  TRACE_STR(IMXRT_TRACEERR_BADSETADDRESS),
  TRACE_STR(IMXRT_TRACEERR_BADSETCONFIG),
  TRACE_STR(IMXRT_TRACEERR_BADSETFEATURE),
  TRACE_STR(IMXRT_TRACEERR_BINDFAILED),
  TRACE_STR(IMXRT_TRACEERR_DISPATCHSTALL),
  TRACE_STR(IMXRT_TRACEERR_DRIVER),
  TRACE_STR(IMXRT_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(IMXRT_TRACEERR_EP0SETUPSTALLED),
  TRACE_STR(IMXRT_TRACEERR_EPINNULLPACKET),
  TRACE_STR(IMXRT_TRACEERR_EPOUTNULLPACKET),
  TRACE_STR(IMXRT_TRACEERR_INVALIDCTRLREQ),
  TRACE_STR(IMXRT_TRACEERR_INVALIDPARMS),
  TRACE_STR(IMXRT_TRACEERR_IRQREGISTRATION),
  TRACE_STR(IMXRT_TRACEERR_NOEP),
  TRACE_STR(IMXRT_TRACEERR_NOTCONFIGURED),
  TRACE_STR(IMXRT_TRACEERR_REQABORTED),
  TRACE_STR_END
};

const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(IMXRT_TRACEINTID_USB),
  TRACE_STR(IMXRT_TRACEINTID_CLEARFEATURE),
  TRACE_STR(IMXRT_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(IMXRT_TRACEINTID_DEVRESET),
  TRACE_STR(IMXRT_TRACEINTID_DISPATCH),
  TRACE_STR(IMXRT_TRACEINTID_EP0COMPLETE),
  TRACE_STR(IMXRT_TRACEINTID_EP0NAK),
  TRACE_STR(IMXRT_TRACEINTID_EP0SETUP),
  TRACE_STR(IMXRT_TRACEINTID_EPGETSTATUS),
  TRACE_STR(IMXRT_TRACEINTID_EPIN),
  TRACE_STR(IMXRT_TRACEINTID_EPINQEMPTY),
  TRACE_STR(IMXRT_TRACEINTID_EP0INSETADDRESS),
  TRACE_STR(IMXRT_TRACEINTID_EPOUT),
  TRACE_STR(IMXRT_TRACEINTID_EPOUTQEMPTY),
  TRACE_STR(IMXRT_TRACEINTID_EP0SETUPSETADDRESS),
  TRACE_STR(IMXRT_TRACEINTID_FRAME),
  TRACE_STR(IMXRT_TRACEINTID_GETCONFIG),
  TRACE_STR(IMXRT_TRACEINTID_GETSETDESC),
  TRACE_STR(IMXRT_TRACEINTID_GETSETIF),
  TRACE_STR(IMXRT_TRACEINTID_GETSTATUS),
  TRACE_STR(IMXRT_TRACEINTID_IFGETSTATUS),
  TRACE_STR(IMXRT_TRACEINTID_SETCONFIG),
  TRACE_STR(IMXRT_TRACEINTID_SETFEATURE),
  TRACE_STR(IMXRT_TRACEINTID_SUSPENDED),
  TRACE_STR(IMXRT_TRACEINTID_RESUMED),
  TRACE_STR(IMXRT_TRACEINTID_SYNCHFRAME),
  TRACE_STR_END
};
#endif

