apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
  uint8_t                 ep0state;      /* State of certain EP0 operations */
                                         /* buffer for EP0 short transfers */
  uint8_t                 ep0buf[64] CACHE_ALIGNED_DATA;
  uint8_t                 paddr;         /* Address assigned by SETADDRESS */
  uint8_t                 stalled:1;     /* 1: Protocol stalled */
  uint8_t                 selfpowered:1; /* 1: Device is self powered */
  uint8_t                 paddrset:1;    /* 1: Peripheral addr has been set */
  uint8_t                 attached:1;    /* 1: Host attached */
  uint8_t                 suspended:1;   /* 1: Suspended */
  uint32_t                softprio;      /* Bitset of high priority interrupts */
  uint32_t                epavail;       /* Bitset of available endpoints */
#ifdef CONFIG_IMXRT_USBDEV_FRAME_INTERRUPT
  uint32_t                sof;           /* Last start-of-frame */
#endif

  uint16_t                ep0buf_len;
  struct usb_ctrlreq_s    ep0ctrl;

  /* The endpoint list */

  struct imxrt_ep_s       eplist[IMXRT_NPHYSENDPOINTS];
};

#define EP0STATE_IDLE             0        /* Idle State, leave on receiving a setup packet or epsubmit */
#define EP0STATE_SETUP_OUT        1        /* Setup Packet received - SET/CLEAR */
#define EP0STATE_SETUP_IN         2        /* Setup Packet received - GET */
#define EP0STATE_SHORTREAD        3        /* Short read without a usb_request */
#define EP0STATE_SHORTWRITE       4        /* Short write without a usb_request */
#define EP0STATE_WAIT_NAK_OUT     5        /* Waiting for Host to illicit status phase (GET) */
#define EP0STATE_WAIT_NAK_IN      6        /* Waiting for Host to illicit status phase (SET/CLEAR) */
#define EP0STATE_WAIT_STATUS_OUT  7        /* Wait for status phase to complete */
#define EP0STATE_WAIT_STATUS_IN   8        /* Wait for status phase to complete */
#define EP0STATE_DATA_IN          9
#define EP0STATE_DATA_OUT         10

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#ifdef CONFIG_IMXRT_USBDEV_REGDEBUG
static uint32_t imxrt_getreg(uint32_t addr);
static void imxrt_putreg(uint32_t val, uint32_t addr);
#else
#  define imxrt_getreg(addr)     getreg32(addr)
#  define imxrt_putreg(val,addr) putreg32(val,addr)
#endif

static inline void imxrt_clrbits(uint32_t mask, uint32_t addr);
static inline void imxrt_setbits(uint32_t mask, uint32_t addr);
static inline void imxrt_chgbits(uint32_t mask, uint32_t val, uint32_t addr);

/* Request queue operations *************************************************/

static struct imxrt_req_s *imxrt_rqdequeue(
    struct imxrt_ep_s *privep);
static bool       imxrt_rqenqueue(struct imxrt_ep_s *privep,
                    struct imxrt_req_s *req);

/* Low level data transfers and request operations **************************/

static inline void imxrt_writedtd(struct imxrt_dtd_s *dtd,
                                  const uint8_t *data,
                                  uint32_t nbytes);
static inline void imxrt_queuedtd(uint8_t epphy, struct imxrt_dtd_s *dtd);
static inline void imxrt_ep0xfer(uint8_t epphy, uint8_t *data,
                                 uint32_t nbytes);
static void        imxrt_readsetup(uint8_t epphy,
                                   struct usb_ctrlreq_s *ctrl);

static inline void imxrt_set_address(struct imxrt_usbdev_s *priv,
                                     uint16_t address);

static void        imxrt_flushep(struct imxrt_ep_s *privep);

static int         imxrt_progressep(struct imxrt_ep_s *privep);
static void        imxrt_reqcomplete(struct imxrt_ep_s *privep,
                     struct imxrt_req_s *privreq, int16_t result);

static void        imxrt_cancelrequests(struct imxrt_ep_s *privep,
                                        int16_t status);

/* Interrupt handling *******************************************************/

static struct imxrt_ep_s *imxrt_epfindbyaddr(struct imxrt_usbdev_s *priv,
                     uint16_t eplog);
static void        imxrt_dispatchrequest(struct imxrt_usbdev_s *priv,
                     const struct usb_ctrlreq_s *ctrl);
static void        imxrt_ep0configure(struct imxrt_usbdev_s *priv);
static void        imxrt_usbreset(struct imxrt_usbdev_s *priv);

static inline void imxrt_ep0state(struct imxrt_usbdev_s *priv,
                                  uint16_t state);
static void        imxrt_ep0setup(struct imxrt_usbdev_s *priv);

static void        imxrt_ep0complete(struct imxrt_usbdev_s *priv,
                                     uint8_t epphy);
static void        imxrt_ep0nak(struct imxrt_usbdev_s *priv, uint8_t epphy);
static bool        imxrt_epcomplete(struct imxrt_usbdev_s *priv,
                                    uint8_t epphy);

static int         imxrt_usbinterrupt(int irq, void *context,
                                      void *arg);

/* Endpoint operations ******************************************************/

/* USB device controller operations *****************************************/

static int         imxrt_epconfigure(struct usbdev_ep_s *ep,
                     const struct usb_epdesc_s *desc, bool last);
static int         imxrt_epdisable(struct usbdev_ep_s *ep);
static struct usbdev_req_s *imxrt_epallocreq(struct usbdev_ep_s *ep);
static void        imxrt_epfreereq(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *);
#ifdef CONFIG_USBDEV_DMA
static void       *imxrt_epallocbuffer(struct usbdev_ep_s *ep,
                     uint16_t bytes);
static void        imxrt_epfreebuffer(struct usbdev_ep_s *ep,
                     void *buf);
#endif
static int         imxrt_epsubmit(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);
static int         imxrt_epcancel(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);
static int         imxrt_epstall(struct usbdev_ep_s *ep, bool resume);

