apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
static struct usbdev_ep_s *imxrt_allocep(struct usbdev_s *dev,
                     uint8_t epno, bool in, uint8_t eptype);
static void        imxrt_freeep(struct usbdev_s *dev,
                                struct usbdev_ep_s *ep);
static int         imxrt_getframe(struct usbdev_s *dev);
static int         imxrt_wakeup(struct usbdev_s *dev);
static int         imxrt_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int         imxrt_pullup(struct usbdev_s *dev, bool enable);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct imxrt_usbdev_s g_usbdev;

static struct imxrt_dqh_s g_qh[IMXRT_NPHYSENDPOINTS]
                               aligned_data(2048);

static struct imxrt_dtd_s g_td[IMXRT_NPHYSENDPOINTS]
                               aligned_data(32);

static const struct usbdev_epops_s g_epops =
{
  .configure   = imxrt_epconfigure,
  .disable     = imxrt_epdisable,
  .allocreq    = imxrt_epallocreq,
  .freereq     = imxrt_epfreereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = imxrt_epallocbuffer,
  .freebuffer  = imxrt_epfreebuffer,
#endif
  .submit      = imxrt_epsubmit,
  .cancel      = imxrt_epcancel,
  .stall       = imxrt_epstall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = imxrt_allocep,
  .freeep      = imxrt_freeep,
  .getframe    = imxrt_getframe,
  .wakeup      = imxrt_wakeup,
  .selfpowered = imxrt_selfpowered,
  .pullup      = imxrt_pullup,
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_getreg
 *
 * Description:
 *   Get the contents of an IMXRT3x register
 *
 ****************************************************************************/

#ifdef CONFIG_IMXRT_USBDEV_REGDEBUG
static uint32_t imxrt_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              uinfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          uinfo("[repeats %d more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  uinfo("%08x->%08x\n", addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: imxrt_putreg
 *
 * Description:
 *   Set the contents of an IMXRT3x register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_IMXRT_USBDEV_REGDEBUG
static void imxrt_putreg(uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  uinfo("%08x<-%08x\n", addr, val);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: imxrt_clrbits
 *
 * Description:
 *   Clear bits in a register
 *
 ****************************************************************************/

static inline void imxrt_clrbits(uint32_t mask, uint32_t addr)
{
  uint32_t reg = imxrt_getreg(addr);

  reg &= ~mask;
  imxrt_putreg(reg, addr);
}

/****************************************************************************
 * Name: imxrt_setbits
 *
 * Description:
 *   Set bits in a register
 *
 ****************************************************************************/

static inline void imxrt_setbits(uint32_t mask, uint32_t addr)
{
  uint32_t reg = imxrt_getreg(addr);

  reg |= mask;
  imxrt_putreg(reg, addr);
}

/****************************************************************************
 * Name: imxrt_chgbits
 *
 * Description:
 *   Change bits in a register
 *
 ****************************************************************************/

static inline void imxrt_chgbits(uint32_t mask, uint32_t val, uint32_t addr)
{
  uint32_t reg = imxrt_getreg(addr);

  reg &= ~mask;
  reg |= val;
  imxrt_putreg(reg, addr);
}

/****************************************************************************
 * Name: imxrt_rqdequeue
 *
 * Description:
 *   Remove a request from an endpoint request queue
 *
 ****************************************************************************/

static struct imxrt_req_s *imxrt_rqdequeue(struct imxrt_ep_s *privep)
{
  struct imxrt_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: imxrt_rqenqueue
 *
 * Description:
 *   Add a request from an endpoint request queue
 *
 ****************************************************************************/

static bool imxrt_rqenqueue(struct imxrt_ep_s *privep,
                            struct imxrt_req_s *req)
{
  bool is_empty = !privep->head;

