apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
  req->flink = NULL;
  if (is_empty)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }

  return is_empty;
}

/****************************************************************************
 * Name: imxrt_writedtd
 *
 * Description:
 *   Initialise a DTD to transfer the data
 *
 ****************************************************************************/

static inline void imxrt_writedtd(struct imxrt_dtd_s *dtd,
                                  const uint8_t *data,
                                  uint32_t nbytes)
{
  dtd->nextdesc  = DTD_NEXTDESC_INVALID;
  dtd->config    = DTD_CONFIG_LENGTH(nbytes) | DTD_CONFIG_IOC |
      DTD_CONFIG_ACTIVE;
  dtd->buffer0   = ((uint32_t) data);
  dtd->buffer1   = (((uint32_t) data) + 0x1000) & 0xfffff000;
  dtd->buffer2   = (((uint32_t) data) + 0x2000) & 0xfffff000;
  dtd->buffer3   = (((uint32_t) data) + 0x3000) & 0xfffff000;
  dtd->buffer4   = (((uint32_t) data) + 0x4000) & 0xfffff000;
  dtd->xfer_len  = nbytes;

  up_flush_dcache((uintptr_t)dtd,
                  (uintptr_t)dtd + sizeof(struct imxrt_dtd_s));
  up_flush_dcache((uintptr_t)data,
                  (uintptr_t)data + nbytes);
}

/****************************************************************************
 * Name: imxrt_queuedtd
 *
 * Description:
 *   Add the DTD to the device list
 *
 * Assumptions:
 *   DTD is already flushed to RAM.
 *
 ****************************************************************************/

static void imxrt_queuedtd(uint8_t epphy, struct imxrt_dtd_s *dtd)
{
  struct imxrt_dqh_s *dqh = &g_qh[epphy];

  /* Queue the DTD onto the Endpoint
   * NOTE - this only works when no DTD is currently queued
   */

  dqh->overlay.nextdesc = (uint32_t) dtd;
  dqh->overlay.config  &= ~(DTD_CONFIG_ACTIVE | DTD_CONFIG_HALTED);

  up_flush_dcache((uintptr_t)dqh,
                  (uintptr_t)dqh + sizeof(struct imxrt_dqh_s));

  uint32_t bit = IMXRT_ENDPTMASK(epphy);

  imxrt_setbits(bit, IMXRT_USBDEV_ENDPTPRIME(0));

  while (imxrt_getreg(IMXRT_USBDEV_ENDPTPRIME(0)) & bit)
    {
    }
}

/****************************************************************************
 * Name: imxrt_ep0xfer
 *
 * Description:
 *   Schedule a short transfer for Endpoint 0 (IN or OUT)
 *
 ****************************************************************************/

static inline void imxrt_ep0xfer(uint8_t epphy, uint8_t *buf,
                                 uint32_t nbytes)
{
  struct imxrt_dtd_s *dtd = &g_td[epphy];

  imxrt_writedtd(dtd, buf, nbytes);

  imxrt_queuedtd(epphy, dtd);
}

/****************************************************************************
 * Name: imxrt_readsetup
 *
 * Description:
 *   Read a Setup packet from the DTD.
 *
 ****************************************************************************/

static void imxrt_readsetup(uint8_t epphy, struct usb_ctrlreq_s *ctrl)
{
  struct imxrt_dqh_s *dqh = &g_qh[epphy];
  int i;

  do
    {
      /* Set the trip wire */

      imxrt_setbits(USBDEV_USBCMD_SUTW, IMXRT_USBDEV_USBCMD(0));

      up_invalidate_dcache((uintptr_t)dqh,
                           (uintptr_t)dqh + sizeof(struct imxrt_dqh_s));

      /* Copy the request... */

      for (i = 0; i < 8; i++)
        {
          ((uint8_t *) ctrl)[i] = ((uint8_t *) dqh->setup)[i];
        }
    }
  while (!(imxrt_getreg(IMXRT_USBDEV_USBCMD(0)) & USBDEV_USBCMD_SUTW));

  /* Clear the trip wire */

  imxrt_clrbits(USBDEV_USBCMD_SUTW, IMXRT_USBDEV_USBCMD(0));

  /* Clear the Setup Interrupt */

  imxrt_putreg(IMXRT_ENDPTMASK(IMXRT_EP0_OUT),
               IMXRT_USBDEV_ENDPTSETUPSTAT(0));
}

/****************************************************************************
 * Name: imxrt_set_address
 *
 * Description:
 *   Set the devices USB address
 *
 ****************************************************************************/

static inline void imxrt_set_address(struct imxrt_usbdev_s *priv,
                                     uint16_t address)
{
  priv->paddr    = address;
  priv->paddrset = address != 0;

  imxrt_chgbits(USBDEV_DEVICEADDR_MASK,
                priv->paddr << USBDEV_DEVICEADDR_SHIFT,
                IMXRT_USBDEV_DEVICEADDR(0));
}

/****************************************************************************
 * Name: imxrt_flushep
 *
 * Description:
 *   Flush any primed descriptors from this ep
 *
 ****************************************************************************/

static void imxrt_flushep(struct imxrt_ep_s *privep)
{
  uint32_t mask = IMXRT_ENDPTMASK(privep->epphy);

  do
    {
      imxrt_putreg(mask, IMXRT_USBDEV_ENDPTFLUSH(0));
      while ((imxrt_getreg(IMXRT_USBDEV_ENDPTFLUSH(0)) & mask) != 0)
        {
        }
    }
  while ((imxrt_getreg(IMXRT_USBDEV_ENDPTSTATUS(0)) & mask) != 0);
}

/****************************************************************************
 * Name: imxrt_progressep
 *
 * Description:
 *   Progress the Endpoint by priming the first request into the queue head
 *
 ****************************************************************************/

static int imxrt_progressep(struct imxrt_ep_s *privep)
{
  struct imxrt_dtd_s *dtd = &g_td[privep->epphy];
  struct imxrt_req_s *privreq;

  /* Check the request from the head of the endpoint request queue */

  privreq = imxrt_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EPINQEMPTY), 0);
      return OK;
    }

  /* Ignore any attempt to send a zero length packet */

  if (privreq->req.len == 0)
    {
      /* If the class driver is responding to a setup packet, then wait for
       * the host to illicit the response
       */

      if (privep->epphy == IMXRT_EP0_IN &&
          privep->dev->ep0state == EP0STATE_SETUP_OUT)
        {
          imxrt_ep0state(privep->dev, EP0STATE_WAIT_NAK_IN);
        }
      else
        {
          if (IMXRT_EPPHYIN(privep->epphy))
            {
              usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_EPINNULLPACKET), 0);
            }
          else
            {
              usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_EPOUTNULLPACKET), 0);
            }
        }

      imxrt_reqcomplete(privep, imxrt_rqdequeue(privep), OK);
      return OK;
    }

  if (privep->epphy == IMXRT_EP0_IN)
    {
      imxrt_ep0state(privep->dev,  EP0STATE_DATA_IN);
    }
  else if (privep->epphy == IMXRT_EP0_OUT)
    {
      imxrt_ep0state(privep->dev, EP0STATE_DATA_OUT);
    }

