apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
  int bytesleft = privreq->req.len - privreq->req.xfrd;

  if (IMXRT_EPPHYIN(privep->epphy))
    {
      usbtrace(TRACE_WRITE(privep->epphy), privreq->req.xfrd);
    }
  else
    {
      usbtrace(TRACE_READ(privep->epphy), privreq->req.xfrd);
    }

  /* Initialise the DTD to transfer the next chunk */

  imxrt_writedtd(dtd, privreq->req.buf + privreq->req.xfrd, bytesleft);

  /* Then queue onto the DQH */

  imxrt_queuedtd(privep->epphy, dtd);

  return OK;
}

/****************************************************************************
 * Name: imxrt_reqcomplete
 *
 * Description:
 *   Handle termination of the request at the head of the endpoint request
 *   queue.
 *
 ****************************************************************************/

static void imxrt_reqcomplete(struct imxrt_ep_s *privep,
                              struct imxrt_req_s *privreq, int16_t result)
{
  /* If endpoint 0, temporarily reflect the state of protocol stalled
   * in the callback.
   */

  bool stalled = privep->stalled;

  if (privep->epphy == IMXRT_EP0_IN)
    {
      privep->stalled = privep->dev->stalled;
    }

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);

  /* Restore the stalled indication */

  privep->stalled = stalled;
}

/****************************************************************************
 * Name: imxrt_cancelrequests
 *
 * Description:
 *   Cancel all pending requests for an endpoint
 *
 ****************************************************************************/

static void imxrt_cancelrequests(struct imxrt_ep_s *privep, int16_t status)
{
  if (!imxrt_rqempty(privep))
    {
      imxrt_flushep(privep);
    }

  while (!imxrt_rqempty(privep))
    {
      /* FIXME: the entry at the head should be sync'd with the DTD
       * FIXME: only report the error status if the transfer hasn't completed
       */

      usbtrace(TRACE_COMPLETE(privep->epphy),
               (imxrt_rqpeek(privep))->req.xfrd);
      imxrt_reqcomplete(privep, imxrt_rqdequeue(privep), status);
    }
}

/****************************************************************************
 * Name: imxrt_epfindbyaddr
 *
 * Description:
 *   Find the physical endpoint structure corresponding to a logic endpoint
 *   address
 *
 ****************************************************************************/

static struct imxrt_ep_s *imxrt_epfindbyaddr(struct imxrt_usbdev_s *priv,
                         uint16_t eplog)
{
  struct imxrt_ep_s *privep;
  int i;

  /* Endpoint zero is a special case */

  if (USB_EPNO(eplog) == 0)
    {
      return &priv->eplist[0];
    }

  /* Handle the remaining */

  for (i = 1; i < IMXRT_NPHYSENDPOINTS; i++)
    {
      privep = &priv->eplist[i];

      /* Same logical endpoint number? (includes direction bit) */

      if (eplog == privep->ep.eplog)
        {
          /* Return endpoint found */

          return privep;
        }
    }

  /* Return endpoint not found */

  return NULL;
}

/****************************************************************************
 * Name: imxrt_dispatchrequest
 *
 * Description:
 *   Provide unhandled setup actions to the class driver. This is logically
 *   part of the USB interrupt handler.
 *
 ****************************************************************************/

static void imxrt_dispatchrequest(struct imxrt_usbdev_s *priv,
                                    const struct usb_ctrlreq_s *ctrl)
{
  int ret = -EIO;

  usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_DISPATCH), 0);
  if (priv->driver)
    {
      /* Forward to the control request to the class driver implementation */

      ret = CLASS_SETUP(priv->driver, &priv->usbdev, ctrl, priv->ep0buf,
                        priv->ep0buf_len);
    }

  if (ret < 0)
    {
      /* Stall on failure */

      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_DISPATCHSTALL), 0);
      priv->stalled = true;
    }
}

/****************************************************************************
 * Name: imxrt_ep0configure
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void imxrt_ep0configure(struct imxrt_usbdev_s *priv)
{
  /* Enable ep0 IN and ep0 OUT */

  g_qh[IMXRT_EP0_OUT].capability =
      (DQH_CAPABILITY_MAX_PACKET(CONFIG_USBDEV_EP0_MAXSIZE) |
          DQH_CAPABILITY_IOS | DQH_CAPABILITY_ZLT);

  g_qh[IMXRT_EP0_IN].capability =
      (DQH_CAPABILITY_MAX_PACKET(CONFIG_USBDEV_EP0_MAXSIZE) |
          DQH_CAPABILITY_IOS | DQH_CAPABILITY_ZLT);

  g_qh[IMXRT_EP0_OUT].currdesc = DTD_NEXTDESC_INVALID;
  g_qh[IMXRT_EP0_IN].currdesc = DTD_NEXTDESC_INVALID;

  up_clean_dcache((uintptr_t)g_qh,
                  (uintptr_t)g_qh + (sizeof(struct imxrt_dqh_s) * 2));

  /* Enable EP0 */

  imxrt_setbits(USBDEV_ENDPTCTRL0_RXE | USBDEV_ENDPTCTRL0_TXE,
                IMXRT_USBDEV_ENDPTCTRL0(0));
}

/****************************************************************************
 * Name: imxrt_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void imxrt_usbreset(struct imxrt_usbdev_s *priv)
{
  int epphy;

  /* Disable all endpoints. Control endpoint 0 is always enabled */

  imxrt_clrbits(USBDEV_ENDPTCTRL_RXE | USBDEV_ENDPTCTRL_TXE,
                IMXRT_USBDEV_ENDPTCTRL1(0));
  imxrt_clrbits(USBDEV_ENDPTCTRL_RXE | USBDEV_ENDPTCTRL_TXE,
                IMXRT_USBDEV_ENDPTCTRL2(0));
  imxrt_clrbits(USBDEV_ENDPTCTRL_RXE | USBDEV_ENDPTCTRL_TXE,
                IMXRT_USBDEV_ENDPTCTRL3(0));
  imxrt_clrbits(USBDEV_ENDPTCTRL_RXE | USBDEV_ENDPTCTRL_TXE,
                IMXRT_USBDEV_ENDPTCTRL4(0));
  imxrt_clrbits(USBDEV_ENDPTCTRL_RXE | USBDEV_ENDPTCTRL_TXE,
                IMXRT_USBDEV_ENDPTCTRL5(0));

  /* Clear all pending interrupts */

  imxrt_putreg(imxrt_getreg(IMXRT_USBDEV_ENDPTNAK(0)),
               IMXRT_USBDEV_ENDPTNAK(0));
  imxrt_putreg(imxrt_getreg(IMXRT_USBDEV_ENDPTSETUPSTAT(0)),
               IMXRT_USBDEV_ENDPTSETUPSTAT(0));
  imxrt_putreg(imxrt_getreg(IMXRT_USBDEV_ENDPTCOMPLETE(0)),
               IMXRT_USBDEV_ENDPTCOMPLETE(0));

  /* Wait for all prime operations to have completed and then flush all
   * DTDs
   */

