apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
  while (imxrt_getreg(IMXRT_USBDEV_ENDPTPRIME(0)) != 0)
    {
    }

  imxrt_putreg(IMXRT_ENDPTMASK_ALL, IMXRT_USBDEV_ENDPTFLUSH(0));
  while (imxrt_getreg(IMXRT_USBDEV_ENDPTFLUSH(0)))
    {
    }

  /* Reset endpoints */

  for (epphy = 0; epphy < IMXRT_NPHYSENDPOINTS; epphy++)
    {
      struct imxrt_ep_s *privep = &priv->eplist[epphy];

      imxrt_cancelrequests(privep, -ESHUTDOWN);

      /* Reset endpoint status */

      privep->stalled = false;
    }

  /* Tell the class driver that we are disconnected. The class
   * driver should then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  /* Set the interrupt Threshold control interval to 0 */

  imxrt_chgbits(USBDEV_USBCMD_ITC_MASK, USBDEV_USBCMD_ITCIMME,
                IMXRT_USBDEV_USBCMD(0));

  /* Zero out the Endpoint queue heads */

  memset ((void *) g_qh, 0, sizeof (g_qh));
  memset ((void *) g_td, 0, sizeof (g_td));

  up_clean_dcache((uintptr_t)g_qh, (uintptr_t)g_qh + sizeof(g_qh));
  up_clean_dcache((uintptr_t)g_td, (uintptr_t)g_td + sizeof(g_td));

  /* Set USB address to 0 */

  imxrt_set_address(priv, 0);

  /* Initialise the Endpoint List Address */

  imxrt_putreg((uint32_t)g_qh, IMXRT_USBDEV_ENDPOINTLIST(0));

  /* EndPoint 0 initialization */

  imxrt_ep0configure(priv);

  /* Enable Device interrupts */

  imxrt_putreg(USB_FRAME_INT | USB_ERROR_INT | USBDEV_USBINTR_NAKE |
               USBDEV_USBINTR_SLE | USBDEV_USBINTR_URE | USBDEV_USBINTR_PCE |
               USBDEV_USBINTR_UE, IMXRT_USBDEV_USBINTR(0));
}

/****************************************************************************
 * Name: imxrt_setstate
 *
 * Description:
 *   Sets the EP0 state and manages the NAK interrupts
 *
 ****************************************************************************/

static inline void imxrt_ep0state(struct imxrt_usbdev_s *priv,
                                  uint16_t state)
{
  priv->ep0state = state;

  switch (state)
    {
      case EP0STATE_WAIT_NAK_IN:
        {
          imxrt_putreg(IMXRT_ENDPTMASK(IMXRT_EP0_IN),
                       IMXRT_USBDEV_ENDPTNAKEN(0));
          break;
        }

      case EP0STATE_WAIT_NAK_OUT:
        {
          imxrt_putreg(IMXRT_ENDPTMASK(IMXRT_EP0_OUT),
                       IMXRT_USBDEV_ENDPTNAKEN(0));
          break;
        }

      default:
        {
          imxrt_putreg(0, IMXRT_USBDEV_ENDPTNAKEN(0));
          break;
        }
    }
}

/****************************************************************************
 * Name: imxrt_ep0setup
 *
 * Description:
 *   USB Ctrl EP Setup Event. This is logically part of the USB interrupt
 *   handler.  This event occurs when a setup packet is receive on EP0 OUT.
 *
 ****************************************************************************/

static inline void imxrt_ep0setup(struct imxrt_usbdev_s *priv)
{
  struct imxrt_ep_s *privep;
  struct usb_ctrlreq_s *ctrl;
  uint16_t value;
  uint16_t index;
  uint16_t len;

  ctrl = &priv->ep0ctrl;

  /* Terminate any pending requests - since all DTDs will have been retired
   * because of the setup packet.
   */

  imxrt_cancelrequests(&priv->eplist[IMXRT_EP0_OUT], -EPROTO);
  imxrt_cancelrequests(&priv->eplist[IMXRT_EP0_IN],  -EPROTO);

  /* Assume NOT stalled */

  priv->eplist[IMXRT_EP0_OUT].stalled = false;
  priv->eplist[IMXRT_EP0_IN].stalled = false;
  priv->stalled = false;

  /* Read EP0 setup data */

  imxrt_readsetup(IMXRT_EP0_OUT, ctrl);

  /* And extract the little-endian 16-bit values to host order */

  value = GETUINT16(ctrl->value);
  index = GETUINT16(ctrl->index);
  len   = GETUINT16(ctrl->len);

  priv->ep0buf_len = len;

  uinfo("type=%02x req=%02x value=%04x index=%04x len=%04x\n",
        ctrl->type, ctrl->req, value, index, len);

  /* Starting a control request - update state */

  if (ctrl->type & USB_REQ_DIR_IN)
    {
      imxrt_ep0state(priv, EP0STATE_SETUP_IN);
    }
  else
    {
      imxrt_ep0state(priv, EP0STATE_SETUP_OUT);

      if (len > 0)
        {
          imxrt_ep0state(priv, EP0STATE_SHORTREAD);
          imxrt_ep0xfer(IMXRT_EP0_OUT, priv->ep0buf, len);
          return;
        }
    }

  /* Dispatch any non-standard requests */

  if ((ctrl->type & USB_REQ_TYPE_MASK) != USB_REQ_TYPE_STANDARD)
    {
      imxrt_dispatchrequest(priv, ctrl);
    }
  else
    {
      /* Handle standard request.  Pick off the things of interest to the USB
       * device controller driver; pass what is left to the class driver.
       */

      switch (ctrl->req)
        {
          case USB_REQ_GETSTATUS:
            {
              /* type:  device-to-host; recipient = device, interface,
               * endpoint
               * value: 0
               * index: zero interface endpoint
               * len:   2; data = status
               */

              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_GETSTATUS), 0);
              if (!priv->paddrset || len != 2 ||
                  (ctrl->type & USB_REQ_DIR_IN) == 0 || value != 0)
                {
                  priv->stalled = true;
                }
              else
                {
                  switch (ctrl->type & USB_REQ_RECIPIENT_MASK)
                    {
                      case USB_REQ_RECIPIENT_ENDPOINT:
                        {
                          usbtrace(
                              TRACE_INTDECODE(IMXRT_TRACEINTID_EPGETSTATUS),
                              0);
                          privep = imxrt_epfindbyaddr(priv, index);
                          if (!privep)
                            {
                              usbtrace(
                                  TRACE_DEVERROR(
                                      IMXRT_TRACEERR_BADEPGETSTATUS),
                                  0);
                              priv->stalled = true;
                            }
                          else
                            {
                              if (privep->stalled)
                                {
                                  priv->ep0buf[0] = 1; /* Stalled */
                                }
                              else
                                {
                                  priv->ep0buf[0] = 0; /* Not stalled */
                                }

                              priv->ep0buf[1] = 0;

