apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
                              imxrt_ep0xfer(IMXRT_EP0_IN, priv->ep0buf, 2);
                              imxrt_ep0state(priv, EP0STATE_SHORTWRITE);
                            }
                        }
                        break;

                      case USB_REQ_RECIPIENT_DEVICE:
                        {
                          if (index == 0)
                            {
                              usbtrace(
                                  TRACE_INTDECODE(
                                      IMXRT_TRACEINTID_DEVGETSTATUS), 0);

                              /* Features:  Remote Wakeup=YES;
                               * selfpowered=?
                               */

                              priv->ep0buf[0] =
                                  (priv->selfpowered <<
                                      USB_FEATURE_SELFPOWERED) |
                                  (1 << USB_FEATURE_REMOTEWAKEUP);
                              priv->ep0buf[1] = 0;

                              imxrt_ep0xfer(IMXRT_EP0_IN, priv->ep0buf, 2);
                              imxrt_ep0state(priv, EP0STATE_SHORTWRITE);
                            }
                          else
                            {
                              usbtrace(
                                  TRACE_DEVERROR(
                                      IMXRT_TRACEERR_BADDEVGETSTATUS), 0);
                              priv->stalled = true;
                            }
                        }
                        break;

                      case USB_REQ_RECIPIENT_INTERFACE:
                        {
                          usbtrace(
                              TRACE_INTDECODE(IMXRT_TRACEINTID_IFGETSTATUS),
                              0);
                          priv->ep0buf[0] = 0;
                          priv->ep0buf[1] = 0;

                          imxrt_ep0xfer(IMXRT_EP0_IN, priv->ep0buf, 2);
                          imxrt_ep0state(priv, EP0STATE_SHORTWRITE);
                        }
                        break;

                      default:
                        {
                          usbtrace(
                              TRACE_DEVERROR(IMXRT_TRACEERR_BADGETSTATUS),
                              0);
                          priv->stalled = true;
                        }
                        break;
                    }
                }
            }
            break;

          case USB_REQ_CLEARFEATURE:
            {
              /* type:  host-to-device; recipient = device, interface or
               * endpoint
               * value: feature selector
               * index: zero interface endpoint;
               * len:   zero, data = none
               */

              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_CLEARFEATURE), 0);
              if ((ctrl->type & USB_REQ_RECIPIENT_MASK) !=
                  USB_REQ_RECIPIENT_ENDPOINT)
                {
                  imxrt_dispatchrequest(priv, ctrl);
                }
              else if (priv->paddrset != 0 &&
                       value == USB_FEATURE_ENDPOINTHALT &&
                       len == 0 &&
                       (privep = imxrt_epfindbyaddr(priv, index)) != NULL)
                {
                  imxrt_epstall(&privep->ep, true);
                  imxrt_ep0state(priv, EP0STATE_WAIT_NAK_IN);
                }
              else
                {
                  usbtrace(
                      TRACE_DEVERROR(IMXRT_TRACEERR_BADCLEARFEATURE), 0);
                  priv->stalled = true;
                }
            }
            break;

          case USB_REQ_SETFEATURE:
            {
              /* type:  host-to-device; recipient = device, interface,
               * endpoint
               * value: feature selector
               * index: zero interface endpoint;
               * len:   0; data = none
               */

              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_SETFEATURE), 0);
              if (((ctrl->type & USB_REQ_RECIPIENT_MASK) ==
                   USB_REQ_RECIPIENT_DEVICE) &&
                  value == USB_FEATURE_TESTMODE)
                {
                  uinfo("test mode: %d\n", index);
                }
              else if ((ctrl->type & USB_REQ_RECIPIENT_MASK) !=
                       USB_REQ_RECIPIENT_ENDPOINT)
                {
                  imxrt_dispatchrequest(priv, ctrl);
                }
              else if (priv->paddrset != 0 &&
                       value == USB_FEATURE_ENDPOINTHALT &&
                       len == 0 &&
                       (privep = imxrt_epfindbyaddr(priv, index)) != NULL)
                {
                  imxrt_epstall(&privep->ep, false);
                  imxrt_ep0state(priv, EP0STATE_WAIT_NAK_IN);
                }
              else
                {
                  usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_BADSETFEATURE), 0);
                  priv->stalled = true;
                }
            }
            break;

          case USB_REQ_SETADDRESS:
            {
              /* type:  host-to-device; recipient = device
               * value: device address
               * index: 0
               * len:   0; data = none
               */

              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EP0SETUPSETADDRESS),
                       value);
              if (((ctrl->type & USB_REQ_RECIPIENT_MASK) ==
                   USB_REQ_RECIPIENT_DEVICE) &&
                  index == 0 && len == 0 && value < 128)
                {
                  /* Save the address.  We cannot actually change to the next
                   * address until the completion of the status phase.
                   */

                  priv->paddr = ctrl->value[0];
                  priv->paddrset = false;
                  imxrt_ep0state(priv, EP0STATE_WAIT_NAK_IN);
                }
              else
                {
                  usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_BADSETADDRESS), 0);
                  priv->stalled = true;
                }
            }
            break;

          case USB_REQ_GETDESCRIPTOR:
            /* type:  device-to-host; recipient = device
             * value: descriptor type and index
             * index: 0 or language ID;
             * len:   descriptor len; data = descriptor
             */

          case USB_REQ_SETDESCRIPTOR:
            /* type:  host-to-device; recipient = device
             * value: descriptor type and index
             * index: 0 or language ID;
             * len:   descriptor len; data = descriptor
             */

            {
              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_GETSETDESC), 0);
              if ((ctrl->type & USB_REQ_RECIPIENT_MASK) ==
                  USB_REQ_RECIPIENT_DEVICE)
                {
                  imxrt_dispatchrequest(priv, ctrl);
                }
              else
                {
                  usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_BADGETSETDESC), 0);
                  priv->stalled = true;
                }
            }
            break;

          case USB_REQ_GETCONFIGURATION:
            /* type:  device-to-host; recipient = device
             * value: 0;
             * index: 0;
             * len:   1; data = configuration value
             */

            {
              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_GETCONFIG), 0);
              if (priv->paddrset &&
                  ((ctrl->type & USB_REQ_RECIPIENT_MASK) ==
                   USB_REQ_RECIPIENT_DEVICE) &&
                  value == 0 && index == 0 && len == 1)
                {
                  imxrt_dispatchrequest(priv, ctrl);
                }
              else
                {
                  usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_BADGETCONFIG), 0);
                  priv->stalled = true;
                }
            }
            break;

