apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
          case USB_REQ_SETCONFIGURATION:
            /* type:  host-to-device; recipient = device
             * value: configuration value
             * index: 0;
             * len:   0; data = none
             */

            {
              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_SETCONFIG), 0);
              if (((ctrl->type & USB_REQ_RECIPIENT_MASK) ==
                   USB_REQ_RECIPIENT_DEVICE) &&
                  index == 0 && len == 0)
                {
                  imxrt_dispatchrequest(priv, ctrl);
                }
              else
                {
                  usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_BADSETCONFIG), 0);
                  priv->stalled = true;
                }
            }
            break;

          case USB_REQ_GETINTERFACE:
            /* type:  device-to-host; recipient = interface
             * value: 0
             * index: interface;
             * len:   1; data = alt interface
             */

          case USB_REQ_SETINTERFACE:
            /* type:  host-to-device; recipient = interface
             * value: alternate setting
             * index: interface;
             * len:   0; data = none
             */

            {
              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_GETSETIF), 0);
              imxrt_dispatchrequest(priv, ctrl);
            }
            break;

          case USB_REQ_SYNCHFRAME:
            /* type:  device-to-host; recipient = endpoint
             * value: 0
             * index: endpoint;
             * len:   2; data = frame number
             */

            {
              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_SYNCHFRAME), 0);
            }
            break;

          default:
            {
              usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_INVALIDCTRLREQ), 0);
              priv->stalled = true;
            }
            break;
        }
    }

  if (priv->stalled)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_EP0SETUPSTALLED),
               priv->ep0state);
      imxrt_epstall(&priv->eplist[IMXRT_EP0_IN].ep, false);
      imxrt_epstall(&priv->eplist[IMXRT_EP0_OUT].ep, false);
    }
}

/****************************************************************************
 * Name: imxrt_ep0complete
 *
 * Description:
 *   Transfer complete handler for Endpoint 0
 *
 ****************************************************************************/

static void imxrt_ep0complete(struct imxrt_usbdev_s *priv, uint8_t epphy)
{
  struct imxrt_ep_s *privep = &priv->eplist[epphy];

  usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EP0COMPLETE),
           (uint16_t)priv->ep0state);

  switch (priv->ep0state)
    {
      case EP0STATE_DATA_IN:
        if (imxrt_rqempty(privep))
          {
            return;
          }

        if (imxrt_epcomplete(priv, epphy))
          {
            imxrt_ep0state(priv, EP0STATE_WAIT_NAK_OUT);
          }
        break;

      case EP0STATE_DATA_OUT:
        if (imxrt_rqempty(privep))
          {
            return;
          }

        if (imxrt_epcomplete(priv, epphy))
          {
            imxrt_ep0state(priv, EP0STATE_WAIT_NAK_IN);
          }
        break;

      case EP0STATE_SHORTREAD:

        /* Make sure we have updated data after the DMA transfer.
         * This invalidation matches the flush in writedtd().
         */

        up_invalidate_dcache((uintptr_t)priv->ep0buf,
                             (uintptr_t)priv->ep0buf + sizeof(priv->ep0buf));

        imxrt_dispatchrequest(priv, &priv->ep0ctrl);
        imxrt_ep0state(priv, EP0STATE_WAIT_NAK_IN);
        break;

      case EP0STATE_SHORTWRITE:
        imxrt_ep0state(priv, EP0STATE_WAIT_NAK_OUT);
        break;

      case EP0STATE_WAIT_STATUS_IN:
        imxrt_ep0state(priv, EP0STATE_IDLE);

        /* If we've received a SETADDRESS packet, then we set the address
         * now that the status phase has completed
         */

        if (!priv->paddrset && priv->paddr != 0)
          {
            usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EP0INSETADDRESS),
                     (uint16_t)priv->paddr);
            imxrt_set_address(priv, priv->paddr);
          }

        break;

      case EP0STATE_WAIT_STATUS_OUT:
        imxrt_ep0state(priv, EP0STATE_IDLE);
        break;

      default:
#ifdef CONFIG_DEBUG_FEATURES
        DEBUGASSERT(priv->ep0state != EP0STATE_DATA_IN &&
                    priv->ep0state != EP0STATE_DATA_OUT &&
                    priv->ep0state != EP0STATE_SHORTWRITE &&
                    priv->ep0state != EP0STATE_WAIT_STATUS_IN &&
                    priv->ep0state != EP0STATE_WAIT_STATUS_OUT);
#endif
        priv->stalled = true;
        break;
    }

  if (priv->stalled)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_EP0SETUPSTALLED),
               priv->ep0state);
      imxrt_epstall(&priv->eplist[IMXRT_EP0_IN].ep, false);
      imxrt_epstall(&priv->eplist[IMXRT_EP0_OUT].ep, false);
    }
}

/****************************************************************************
 * Name: imxrt_ep0nak
 *
 * Description:
 *   Handle a NAK interrupt on EP0
 *
 ****************************************************************************/

static void imxrt_ep0nak(struct imxrt_usbdev_s *priv, uint8_t epphy)
{
  usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EP0NAK),
           (uint16_t)priv->ep0state);

  switch (priv->ep0state)
    {
      case EP0STATE_WAIT_NAK_IN:
        {
          imxrt_ep0xfer(IMXRT_EP0_IN, NULL, 0);
          imxrt_ep0state(priv, EP0STATE_WAIT_STATUS_IN);
          break;
        }

      case EP0STATE_WAIT_NAK_OUT:
        {
          imxrt_ep0xfer(IMXRT_EP0_OUT, NULL, 0);
          imxrt_ep0state(priv, EP0STATE_WAIT_STATUS_OUT);
          break;
        }

      default:
        {
#ifdef CONFIG_DEBUG_FEATURES
          DEBUGASSERT(priv->ep0state != EP0STATE_WAIT_NAK_IN &&
            priv->ep0state != EP0STATE_WAIT_NAK_OUT);
#endif
          priv->stalled = true;
          break;
        }
    }

  if (priv->stalled)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_EP0SETUPSTALLED),
               priv->ep0state);
      imxrt_epstall(&priv->eplist[IMXRT_EP0_IN].ep, false);
      imxrt_epstall(&priv->eplist[IMXRT_EP0_OUT].ep, false);
    }
}

/****************************************************************************
 * Name: imxrt_epcomplete
 *
 * Description:
 *   Transfer complete handler for Endpoints other than 0
 *   returns whether the request at the head has completed
 *
 ****************************************************************************/

bool imxrt_epcomplete(struct imxrt_usbdev_s *priv, uint8_t epphy)
{
  struct imxrt_ep_s  *privep  = &priv->eplist[epphy];
  struct imxrt_req_s *privreq = privep->head;
  struct imxrt_dtd_s *dtd     = &g_td[epphy];

  if (privreq == NULL)        /* This shouldn't really happen */
    {
      if (IMXRT_EPPHYOUT(privep->epphy))
        {
          usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EPINQEMPTY), 0);
        }
      else
        {
          usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EPOUTQEMPTY), 0);
        }

