apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
      return true;
    }

  /* Make sure we have updated data after the DMA transfer.
   * This invalidation matches the flush in writedtd().
   */

  up_invalidate_dcache((uintptr_t)dtd,
                       (uintptr_t)dtd + sizeof(struct imxrt_dtd_s));
  up_invalidate_dcache((uintptr_t)dtd->buffer0,
                       (uintptr_t)dtd->buffer0 + dtd->xfer_len);

  int xfrd = dtd->xfer_len - (dtd->config >> 16);

  privreq->req.xfrd += xfrd;

  bool complete = true;

  if (IMXRT_EPPHYOUT(privep->epphy))
    {
      /* read(OUT) completes when request filled, or a short transfer is
       * received
       */

      usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EPIN), complete);
    }
  else
    {
      /* write(IN) completes when request finished, unless we need to
       * terminate with a ZLP
       */

      bool need_zlp = (xfrd == privep->ep.maxpacket) &&
          ((privreq->req.flags & USBDEV_REQFLAGS_NULLPKT) != 0);

      complete = (privreq->req.xfrd >= privreq->req.len && !need_zlp);

      usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EPOUT), complete);
    }

  /* If the transfer is complete, then dequeue and progress any further
   * queued requests
   */

  if (complete)
    {
      privreq = imxrt_rqdequeue(privep);
    }

  if (!imxrt_rqempty(privep))
    {
      imxrt_progressep(privep);
    }

  /* Now it's safe to call the completion callback as it may well submit a
   * new request
   */

  if (complete)
    {
      usbtrace(TRACE_COMPLETE(privep->epphy), privreq->req.xfrd);
      imxrt_reqcomplete(privep, privreq, OK);
    }

  return complete;
}

/****************************************************************************
 * Name: imxrt_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int imxrt_usbinterrupt(int irq, void *context, void *arg)
{
  struct imxrt_usbdev_s *priv = &g_usbdev;
  uint32_t disr;
  uint32_t portsc1;
  uint32_t n;

  usbtrace(TRACE_INTENTRY(IMXRT_TRACEINTID_USB), 0);

  /* Read the interrupts and then clear them */

  disr = imxrt_getreg(IMXRT_USBDEV_USBSTS(0));
  imxrt_putreg(disr, IMXRT_USBDEV_USBSTS(0));

  if (disr & USBDEV_USBSTS_URI)
    {
      usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_DEVRESET), 0);

      imxrt_usbreset(priv);

      usbtrace(TRACE_INTEXIT(IMXRT_TRACEINTID_USB), 0);
      return OK;
    }

  /* When the device controller enters a suspend state from an active state,
   * the SLI bit will be set to a one.
   */

  if (!priv->suspended && (disr & USBDEV_USBSTS_SLI) != 0)
    {
      usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_SUSPENDED), 0);

      /* Inform the Class driver of the suspend event */

      priv->suspended = 1;
      if (priv->driver)
        {
          CLASS_SUSPEND(priv->driver, &priv->usbdev);
        }

      /* TODO: Perform power management operations here. */
    }

  /* The device controller clears the SLI bit upon exiting from a suspend
   * state. This bit can also be cleared by software writing a one to it.
   */

  else if (priv->suspended && (disr & USBDEV_USBSTS_SLI) == 0)
    {
      usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_RESUMED), 0);

      /* Inform the Class driver of the resume event */

      priv->suspended = 0;
      if (priv->driver)
        {
          CLASS_RESUME(priv->driver, &priv->usbdev);
        }

      /* TODO: Perform power management operations here. */
    }

  if (disr & USBDEV_USBSTS_PCI)
    {
      portsc1 = imxrt_getreg(IMXRT_USBDEV_PORTSC1(0));

      if (portsc1 & USBDEV_PRTSC1_HSP)
        {
          priv->usbdev.speed = USB_SPEED_HIGH;
        }
      else
        {
          priv->usbdev.speed = USB_SPEED_FULL;
        }

      if (portsc1 & USBDEV_PRTSC1_FPR)
        {
          /* FIXME: this occurs because of a J-to-K transition detected
           *         while the port is in SUSPEND state - presumambly this
           *         is where the host is resuming the device?
           *
           *  - but do we need to "ack" the interrupt
           */
        }
    }

#ifdef CONFIG_IMXRT_USBDEV_FRAME_INTERRUPT
  if (disr & USBDEV_USBSTS_SRI)
    {
      usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_FRAME), 0);

      uint32_t frindex = imxrt_getreg(IMXRT_USBDEV_FRINDEX(0));
      uint16_t frame_num =
          (frindex & USBDEV_FRINDEX_LFN_MASK) >> USBDEV_FRINDEX_LFN_SHIFT;

      priv->sof = frame_num;
    }
#endif

  if (disr & USBDEV_USBSTS_UEI)
    {
      /* FIXME: these occur when a transfer results in an error condition
       *        it is set alongside USBINT if the DTD also had its IOC
       *        bit set.
       */
    }

  if (disr & USBDEV_USBSTS_UI)
    {
      /* Handle completion interrupts */

      uint32_t mask = imxrt_getreg(IMXRT_USBDEV_ENDPTCOMPLETE(0));

      if (mask)
        {
          /* Clear any NAK interrupt and completion interrupts */

          imxrt_putreg(mask, IMXRT_USBDEV_ENDPTNAK(0));
          imxrt_putreg(mask, IMXRT_USBDEV_ENDPTCOMPLETE(0));

          if (mask & IMXRT_ENDPTMASK(0))
            {
              imxrt_ep0complete(priv, 0);
            }

          if (mask & IMXRT_ENDPTMASK(1))
            {
              imxrt_ep0complete(priv, 1);
            }

          for (n = 1; n < IMXRT_NLOGENDPOINTS; n++)
            {
              if (mask & IMXRT_ENDPTMASK((n << 1)))
                {
                  imxrt_epcomplete(priv, (n << 1));
                }

              if (mask & IMXRT_ENDPTMASK((n << 1)+1))
                {
                  imxrt_epcomplete(priv, (n << 1)+1);
                }
            }
        }

      /* Handle setup interrupts */

      uint32_t setupstat = imxrt_getreg(IMXRT_USBDEV_ENDPTSETUPSTAT(0));

      if (setupstat)
        {
          /* Clear the endpoint complete CTRL OUT and IN when a Setup is
           * received
           */

          imxrt_putreg(IMXRT_ENDPTMASK(IMXRT_EP0_IN) |
                       IMXRT_ENDPTMASK(IMXRT_EP0_OUT),
                       IMXRT_USBDEV_ENDPTCOMPLETE(0));

          if (setupstat & IMXRT_ENDPTMASK(IMXRT_EP0_OUT))
            {
              usbtrace(TRACE_INTDECODE(IMXRT_TRACEINTID_EP0SETUP),
                       setupstat);
              imxrt_ep0setup(priv);
            }
        }
    }

  if (disr & USBDEV_USBSTS_NAKI)
    {
      uint32_t pending = imxrt_getreg(IMXRT_USBDEV_ENDPTNAK(0)) &
                         imxrt_getreg(IMXRT_USBDEV_ENDPTNAKEN(0));

