apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
  if (in)
    {
      epset &= IMXRT_EPINSET;
    }
  else
    {
      epset &= IMXRT_EPOUTSET;
    }

  /* Get the subset matching the requested type */

  switch (eptype)
    {
      case USB_EP_ATTR_XFER_INT: /* Interrupt endpoint */
        {
          epset &= IMXRT_EPINTRSET;
          break;
        }

      case USB_EP_ATTR_XFER_BULK: /* Bulk endpoint */
        {
          epset &= IMXRT_EPBULKSET;
          break;
        }

      case USB_EP_ATTR_XFER_ISOC: /* Isochronous endpoint */
        {
          epset &= IMXRT_EPISOCSET;
          break;
        }

      case USB_EP_ATTR_XFER_CONTROL: /* Control endpoint -- not a valid choice
                                      */
      default:
        {
          usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_BADEPTYPE),
            (uint16_t)eptype);
          return NULL;
        }
    }

  /* Is the resulting endpoint supported by the IMXRT3x? */

  if (epset)
    {
      /* Yes.. now see if any of the request endpoints are available */

      flags = enter_critical_section();
      epset &= priv->epavail;
      if (epset)
        {
          /* Select the lowest bit in the set of matching, available
           * endpoints
           */

          for (epndx = 2; epndx < IMXRT_NPHYSENDPOINTS; epndx++)
            {
              uint32_t bit = 1 << epndx;

              if ((epset & bit) != 0)
                {
                  /* Mark endpoint no longer available */

                  priv->epavail &= ~bit;
                  leave_critical_section(flags);

                  /* And return the pointer to the standard endpoint
                   * structure
                   */

                  return &priv->eplist[epndx].ep;
                }
            }

          /* Shouldn't get here */
        }

      leave_critical_section(flags);
    }

  usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_NOEP), (uint16_t)eplog);
  return NULL;
}

/****************************************************************************
 * Name: imxrt_freeep
 *
 * Description:
 *   Free the previously allocated endpoint
 *
 ****************************************************************************/

static void imxrt_freeep(struct usbdev_s *dev,
                         struct usbdev_ep_s *ep)
{
  struct imxrt_usbdev_s *priv = (struct imxrt_usbdev_s *)dev;
  struct imxrt_ep_s *privep = (struct imxrt_ep_s *)ep;
  irqstate_t flags;

  usbtrace(TRACE_DEVFREEEP, (uint16_t)privep->epphy);

  if (priv && privep)
    {
      /* Mark the endpoint as available */

      flags = enter_critical_section();
      priv->epavail |= (1 << privep->epphy);
      leave_critical_section(flags);
    }
}

/****************************************************************************
 * Name: imxrt_getframe
 *
 * Description:
 *   Returns the current frame number
 *
 ****************************************************************************/

static int imxrt_getframe(struct usbdev_s *dev)
{
#ifdef CONFIG_IMXRT_USBDEV_FRAME_INTERRUPT
  struct imxrt_usbdev_s *priv = (struct imxrt_usbdev_s *)dev;

  /* Return last valid value of SOF read by the interrupt handler */

  usbtrace(TRACE_DEVGETFRAME, (uint16_t)priv->sof);
  return priv->sof;
#else
  uint32_t frindex = imxrt_getreg(IMXRT_USBDEV_FRINDEX(0));
  uint16_t frame_num =
      (frindex & USBDEV_FRINDEX_LFN_MASK) >> USBDEV_FRINDEX_LFN_SHIFT;

  /* Return the last frame number detected by the hardware */

  usbtrace(TRACE_DEVGETFRAME, frame_num);

  return (int)(frame_num);
#endif
}

/****************************************************************************
 * Name: imxrt_wakeup
 *
 * Description:
 *   Tries to wake up the host connected to this device
 *
 ****************************************************************************/

static int imxrt_wakeup(struct usbdev_s *dev)
{
  irqstate_t flags;

  usbtrace(TRACE_DEVWAKEUP, 0);

  flags = enter_critical_section();
  imxrt_setbits(USBDEV_PRTSC1_FPR, IMXRT_USBDEV_PORTSC1(0));
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: imxrt_selfpowered
 *
 * Description:
 *   Sets/clears the device selfpowered feature
 *
 ****************************************************************************/

static int imxrt_selfpowered(struct usbdev_s *dev, bool selfpowered)
{
  struct imxrt_usbdev_s *priv = (struct imxrt_usbdev_s *)dev;

  usbtrace(TRACE_DEVSELFPOWERED, (uint16_t)selfpowered);

#ifdef CONFIG_DEBUG_FEATURES
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_INVALIDPARMS), 0);
      return -ENODEV;
    }
#endif

  priv->selfpowered = selfpowered;
  return OK;
}

/****************************************************************************
 * Name: imxrt_pullup
 *
 * Description:
 *   Software-controlled connect to/disconnect from USB host
 *
 ****************************************************************************/

static int imxrt_pullup(struct usbdev_s *dev, bool enable)
{
  usbtrace(TRACE_DEVPULLUP, (uint16_t)enable);

  irqstate_t flags = enter_critical_section();

  if (enable)
    {
      imxrt_setbits(USBDEV_USBCMD_RS, IMXRT_USBDEV_USBCMD(0));

#ifdef CONFIG_IMXRT_USBDEV_NOVBUS
      /* Create a 'false' power event on the USB port so the MAC connects */

      imxrt_clrbits(USBOTG_OTGSC_VD, IMXRT_USBOTG_OTGSC(0));
      imxrt_setbits(USBOTG_OTGSC_VC, IMXRT_USBOTG_OTGSC(0));
#endif
    }
  else
    {
      imxrt_clrbits(USBDEV_USBCMD_RS, IMXRT_USBDEV_USBCMD(0));
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: arm_usbinitialize
 *
 * Description:
 *   Initialize USB hardware.
 *
 * Assumptions:
 * - This function is called very early in the initialization sequence
 * - PLL  initialization is not performed here but should been in
 *   the low-level boot logic: USB1 PLL must be configured for operation
 *   at 480MHz
 *
 ****************************************************************************/

