apache/nuttx/arch/arm/src/imxrt/imxrt_usbdev.c
void arm_usbinitialize(void)
{
  struct imxrt_usbdev_s *priv = &g_usbdev;
  int i;
  irqstate_t flags;

  flags = enter_critical_section();

  /* Initialize the device state structure */

  memset(priv, 0, sizeof(struct imxrt_usbdev_s));
  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->eplist[IMXRT_EP0_IN].ep;
  priv->epavail    = IMXRT_EPALLSET & ~IMXRT_EPCTRLSET;

  /* Initialize the endpoint list */

  for (i = 0; i < IMXRT_NPHYSENDPOINTS; i++)
    {
      uint32_t bit = 1 << i;

      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the physical endpoint number (which is just the index to the
       * endpoint).
       */

      priv->eplist[i].ep.ops       = &g_epops;
      priv->eplist[i].dev          = priv;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      priv->eplist[i].epphy        = i;
      if (IMXRT_EPPHYIN(i))
        {
          priv->eplist[i].ep.eplog = IMXRT_EPPHYIN2LOG(i);
        }
      else
        {
          priv->eplist[i].ep.eplog = IMXRT_EPPHYOUT2LOG(i);
        }

      /* The maximum packet size may depend on the type of endpoint */

      if ((IMXRT_EPCTRLSET & bit) != 0)
        {
          priv->eplist[i].ep.maxpacket = IMXRT_EP0MAXPACKET;
        }
      else if ((IMXRT_EPINTRSET & bit) != 0)
        {
          priv->eplist[i].ep.maxpacket = IMXRT_INTRMAXPACKET;
        }
      else if ((IMXRT_EPBULKSET & bit) != 0)
        {
          priv->eplist[i].ep.maxpacket = IMXRT_BULKMAXPACKET;
        }
      else /* if ((IMXRT_EPISOCSET & bit) != 0) */
        {
          priv->eplist[i].ep.maxpacket = IMXRT_ISOCMAXPACKET;
        }
    }

  /* Clock run */

  imxrt_clockall_usboh3();

#if defined(CONFIG_ARCH_FAMILY_IMXRT117x) || defined(CONFIG_ARCH_FAMILY_IMXRT118x)
  up_mdelay(1);

  putreg32(USBPHY_PLL_SIC_PLL_POWER |
           USBPHY_PLL_SIC_PLL_REG_ENABLE,
           IMXRT_USBPHY_PLL_SIC_SET(0));

  putreg32(USBPHY_PLL_SIC_PLL_DIV_SEL_MASK,
           IMXRT_USBPHY_PLL_SIC_CLR(0));

  putreg32(USBPHY_PLL_SIC_PLL_DIV_SEL(3),
           IMXRT_USBPHY_PLL_SIC_SET(0));

  putreg32(USBPHY_PLL_SIC_PLL_BYPASS,
           IMXRT_USBPHY_PLL_SIC_CLR(0));

  putreg32(USBPHY_PLL_SIC_PLL_EN_USB_CLKS,
           IMXRT_USBPHY_PLL_SIC_SET(0));

  putreg32(USBPHY_CTRL_CLKGATE,
           IMXRT_USBPHY_CTRL_CLR(0));

  while ((getreg32(IMXRT_USBPHY_PLL_SIC(0)) & USBPHY_PLL_SIC_PLL_LOCK) == 0);

#endif

  /* Disable USB interrupts */

  imxrt_putreg(0, IMXRT_USBDEV_USBINTR(0));

  /* Soft reset PHY and enable clock */

  putreg32(USBPHY_CTRL_SFTRST | USBPHY_CTRL_CLKGATE,
           IMXRT_USBPHY_CTRL_CLR(0));

  /* Disconnect device */

  imxrt_pullup(&priv->usbdev, false);

  /* Reset the controller */

  imxrt_setbits(USBDEV_USBCMD_RST, IMXRT_USBDEV_USBCMD(0));
  while (imxrt_getreg(IMXRT_USBDEV_USBCMD(0)) & USBDEV_USBCMD_RST)
    {
    }

  /* Power up the PHY (turn off power disable) - USBPHYx_PWDn
   * Manual: The USB PHY Power-Down Register provides overall control of the
   * PHY power state. Before programming this register, the PHY clocks must
   * be enabled in registers USBPHYx_CTRLn and
   * CCM_ANALOG_USBPHYx_PLL_480_CTRLn.
   */

  imxrt_putreg(0, IMXRT_USBPHY_PWD(0));

  /* Program the controller to be the USB device controller */

  imxrt_putreg(USBDEV_USBMODE_SDIS | USBDEV_USBMODE_SLOM |
                USBDEV_USBMODE_CM_DEVICE, IMXRT_USBDEV_USBMODE(0));

  /* Attach USB controller interrupt handler */

  irq_attach(IMXRT_IRQ_USBOTG1, imxrt_usbinterrupt, NULL);
  up_enable_irq(IMXRT_IRQ_USBOTG1);

  leave_critical_section(flags);

  /* Reset/Re-initialize the USB hardware */

  imxrt_usbreset(priv);
}

/****************************************************************************
 * Name: arm_usbuninitialize
 ****************************************************************************/

void arm_usbuninitialize(void)
{
  struct imxrt_usbdev_s *priv = &g_usbdev;
  irqstate_t flags;

  usbtrace(TRACE_DEVUNINIT, 0);

  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_DRIVERREGISTERED), 0);
      usbdev_unregister(priv->driver);
    }

  flags = enter_critical_section();

  /* Disconnect device */

  imxrt_pullup(&priv->usbdev, false);
  priv->usbdev.speed = USB_SPEED_UNKNOWN;

  /* Disable and detach IRQs */

  up_disable_irq(IMXRT_IRQ_USBOTG1);
  irq_detach(IMXRT_IRQ_USBOTG1);

  /* Reset the controller */

  imxrt_setbits(USBDEV_USBCMD_RST, IMXRT_USBDEV_USBCMD(0));
  while (imxrt_getreg(IMXRT_USBDEV_USBCMD(0)) & USBDEV_USBCMD_RST)
    {
    }

  /* Turn off USB power and clocking */

  /* Power down the PHY */

  imxrt_putreg(0xffffffff, IMXRT_USBPHY_PWD(0));

  /* Stop clock
   * NOTE: This will interfere with USB OTG 2 and should probably be removed
   * if Device or Host code is expanded to support both OTG Cores.
   */

  imxrt_clockoff_usboh3();

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: usbdev_register
 *
 * Description:
 *   Register a USB device class driver. The class driver's bind() method
 *   will be called to bind it to a USB device driver.
 *
 ****************************************************************************/

int usbdev_register(struct usbdevclass_driver_s *driver)
{
  int ret;

  usbtrace(TRACE_DEVREGISTER, 0);

#ifdef CONFIG_DEBUG_FEATURES
  if (!driver || !driver->ops->bind || !driver->ops->unbind ||
      !driver->ops->disconnect || !driver->ops->setup)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }

  if (g_usbdev.driver)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_DRIVER), 0);
      return -EBUSY;
    }
#endif

  /* First hook up the driver */

  g_usbdev.driver = driver;

  /* Then bind the class driver */

  ret = CLASS_BIND(driver, &g_usbdev.usbdev);
  if (ret)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_BINDFAILED), (uint16_t)-ret);
      g_usbdev.driver = NULL;
    }
  else
    {
      /* Enable USB controller interrupts */

      up_enable_irq(IMXRT_IRQ_USBOTG1);
    }

  return ret;
}

/****************************************************************************
 * Name: usbdev_unregister
 *
 * Description:
 *   Un-register usbdev class driver.If the USB device is connected to a USB
 *   host, it will first disconnect().  The driver is also requested to
 *   unbind() and clean up any device state, before this procedure finally
 *   returns.
 *
 ****************************************************************************/

int usbdev_unregister(struct usbdevclass_driver_s *driver)
{
  usbtrace(TRACE_DEVUNREGISTER, 0);

#ifdef CONFIG_DEBUG_FEATURES
  if (driver != g_usbdev.driver)
    {
      usbtrace(TRACE_DEVERROR(IMXRT_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Unbind the class driver */

  CLASS_UNBIND(driver, &g_usbdev.usbdev);

  /* Disable USB controller interrupts */

  up_disable_irq(IMXRT_IRQ_USBOTG1);

  /* Unhook the driver */

  g_usbdev.driver = NULL;
  return OK;
}
